---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRightNosing
source: html/ca57ed86-830c-7823-0ae7-bd6f345317f1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRightNosing Property

"Right Nosing": (OBSOLETE)

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeRightNosing { get; }
```